Documents/ПередачаДолжников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПередачаДолжников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Передачи</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтдел</xr:Item>
				<xr:Item>InformationRegister.ПривязкаСотрудник</xr:Item>
				<xr:Item>InformationRegister.Выезд</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтветственный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятиеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередачаВСвободныйПул</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольОтдела</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольОтдела</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказПередачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПривязкаСотрудник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаСотрудник</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПривязкаОтдел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаОтдел</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныйПул</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныйПулПовторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПривязкаОтветственный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаОтветственный</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Выезд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Выезд</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Новый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Передачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>Передачи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Получил</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Передал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предархив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РольОтдела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>РольОтдела</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обзвон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выездной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информационный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрекращениеРаботы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПередачаДолжников/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СотрАрхив 		= Справочники.Сотрудники.НайтиПоНаименованию("Архив");
	СотрПредархив 	= Справочники.Сотрудники.НайтиПоНаименованию("Предархив");
	Отказ = ДоступностьИзмененийПоДатеЗапрета(Дата);
	
	Если ОтказПередачи Тогда
		// Проводим, но проводок не делаем
		Возврат;
	КонецЕсли; 
	Если Сотрудник = СотрАрхив Тогда	
		
		//Помещаем договоры в архив
		Для Каждого ТекСтр Из Должники Цикл
			Попытка 
				Об = ТекСтр.Договор.ПолучитьОбъект();
				Об.Статус = Перечисления.СтатусыДоговоров.Архив;
				Об.Записать();
			Исключение
			КонецПопытки;
		КонецЦикла;
		//Помещаем должников без активных договоров в архив
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ПередачаДолжниковДолжники.Должник
		               |ИЗ
		               |	Документ.ПередачаДолжников.Должники КАК ПередачаДолжниковДолжники
		               |ГДЕ
		               |	ПередачаДолжниковДолжники.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЕстьПредархив = Ложь;
			ЕстьАктивные = Ложь;
			ВыбДог = Справочники.Договоры.Выбрать(,Выборка.Должник);
			Пока ВыбДог.Следующий() Цикл
				Если ВыбДог.Статус = перечисления.СтатусыДоговоров.Активный тогда
					ЕстьАктивные = Истина;
				ИначеЕсли ВыбДог.Статус = перечисления.СтатусыДоговоров.Предархив тогда
					ЕстьПредархив = Истина;
				КонецЕсли;
				
			КонецЦикла;

			Если (НЕ ЕстьАктивные) И ЕстьПредархив Тогда
				// регистр ПривязкаСотрудник 
				Движение = Движения.ПривязкаСотрудник.Добавить();
				Движение.Период 	= Дата;
				Движение.Должник 	= Выборка.Должник;
				Движение.Сотрудник 	= СотрАрхив;
				Движение.СотрМенеджер 	= СотрАрхив;
				
				// регистр ПривязкаОтдел 
				Движение = Движения.ПривязкаОтдел.Добавить();
				Движение.Период 		= Дата;
				Движение.Должник 		= Выборка.Должник;
				Движение.Отдел 			= Отдел;
				Движение.СвободныйПул 	= ПередачаВСвободныйПул;
			ИначеЕсли (НЕ ЕстьАктивные) и (НЕ ЕстьПредархив) Тогда
				// регистр ПривязкаСотрудник 
				Движение = Движения.ПривязкаСотрудник.Добавить();
				Движение.Период 	= Дата;
				Движение.Должник 	= Выборка.Должник;
				Движение.Сотрудник 	= СотрАрхив;
				Движение.СотрМенеджер 	= СотрАрхив;
				
				// регистр ПривязкаОтдел 
				Движение = Движения.ПривязкаОтдел.Добавить();
				Движение.Период 		= Дата;
				Движение.Должник 		= Выборка.Должник;
				Движение.Отдел 			= Отдел;
				Движение.СвободныйПул 	= ПередачаВСвободныйПул;
			КонецЕсли;
			
			КонецЦикла;
		
	ИначеЕсли Сотрудник = СотрПредархив Тогда
		//Помещаем договоры в архив
		Для Каждого ТекСтр Из Должники Цикл
			Попытка 
				Об = ТекСтр.Договор.ПолучитьОбъект();
				Об.Статус = Перечисления.СтатусыДоговоров.Предархив;
				Об.Записать();
			Исключение
			КонецПопытки;
		КонецЦикла;
		//Помещаем должников без активных договоров в архив
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ПередачаДолжниковДолжники.Должник
		               |ИЗ
		               |	Документ.ПередачаДолжников.Должники КАК ПередачаДолжниковДолжники
		               |ГДЕ
		               |	ПередачаДолжниковДолжники.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЕстьПредархив = Ложь;
			ЕстьАктивные = Ложь;
			ВыбДог = Справочники.Договоры.Выбрать(,Выборка.Должник);
			Пока ВыбДог.Следующий() Цикл
				Если ВыбДог.Статус = перечисления.СтатусыДоговоров.Активный тогда
					ЕстьАктивные = Истина;
				ИначеЕсли ВыбДог.Статус = перечисления.СтатусыДоговоров.Предархив тогда
					ЕстьПредархив = Истина;
				КонецЕсли;
				
			КонецЦикла;
			Если (НЕ ЕстьАктивные) И ЕстьПредархив Тогда
				// регистр ПривязкаСотрудник 
				Движение = Движения.ПривязкаСотрудник.Добавить();
				Движение.Период 	= Дата;
				Движение.Должник 	= Выборка.Должник;
				Движение.Сотрудник 	= СотрПредархив;
				Движение.СотрМенеджер 	= СотрПредархив;
				
				// регистр ПривязкаОтдел 
				Движение = Движения.ПривязкаОтдел.Добавить();
				Движение.Период 		= Дата;
				Движение.Должник 		= Выборка.Должник;
				Движение.Отдел 			= Отдел;
				Движение.СвободныйПул 	= ПередачаВСвободныйПул;
			ИначеЕсли (НЕ ЕстьАктивные) и (НЕ ЕстьПредархив) Тогда
				// регистр ПривязкаСотрудник 
				Движение = Движения.ПривязкаСотрудник.Добавить();
				Движение.Период 	= Дата;
				Движение.Должник 	= Выборка.Должник;
				Движение.Сотрудник 	= СотрПредархив;
				Движение.СотрМенеджер 	= СотрПредархив;
				
				// регистр ПривязкаОтдел 
				Движение = Движения.ПривязкаОтдел.Добавить();
				Движение.Период 		= Дата;
				Движение.Должник 		= Выборка.Должник;
				Движение.Отдел 			= Отдел;
				Движение.СвободныйПул 	= ПередачаВСвободныйПул;
			КонецЕсли;
			
				
		КонецЦикла;
	Иначе
		Темп = Новый ТаблицаЗначений;
		Темп = Должники.Выгрузить();
	Темп.Свернуть("Должник", "");
		Если НЕ Подписан Тогда
			ПустойОтдел = Справочники.Отделы.ПустаяСсылка();
			
			Для каждого Выборка Из Темп Цикл
				// регистр ПривязкаСотрудник 
				Движение = Движения.ПривязкаСотрудник.Добавить();
				Движение.Период 	= Дата;
				Движение.Должник 	= Выборка.Должник;
				Движение.Сотрудник 	= Менеджер;
				Движение.СотрМенеджер 	= Привязка.ПолучитьСотрМенеджера(Выборка.Должник, Дата);
				
				
				// регистр ПривязкаОтдел 
				Движение = Движения.ПривязкаОтдел.Добавить();
				Движение.Период 		= Дата;
				Движение.Должник 		= Выборка.Должник;
				Движение.Отдел 			= ПустойОтдел;
				Движение.СвободныйПул 	= Ложь;
			КонецЦикла;
			
		Иначе
			Для каждого Выборка Из Темп Цикл
				// регистр ПривязкаСотрудник 
				Движение = Движения.ПривязкаСотрудник.Добавить();
				Движение.Период 	= Дата;
				Движение.Должник 	= Выборка.Должник;
				Движение.Сотрудник 	= Сотрудник;
				Движение.СотрМенеджер 	= Сотрудник;
				
				// регистр ПривязкаОтдел 
				Движение = Движения.ПривязкаОтдел.Добавить();
				Движение.Период 		= Дата;
				Движение.Должник 		= Выборка.Должник;
				Движение.Отдел 			= Отдел;
				Движение.СвободныйПул 	= ПередачаВСвободныйПул;
				
				Если СнятиеОтветственного Тогда
					// регистр ПривязкаОтветственный 
					Движение = Движения.ПривязкаОтветственный.Добавить();
					Движение.Период 		= Дата;
					Движение.Должник 		= Выборка.Должник;
					Движение.Ответственный 	= Справочники.Сотрудники.ПустаяСсылка();
				КонецЕсли; 
				
				Если Отдел.РольОтдела = Перечисления.РольОтдела.Выездной Тогда
					// регистр Выезд 
					Движение = Движения.Выезд.Добавить();
					Движение.Период 	= Дата;
					Движение.Сотрудник 	= Сотрудник;
					Движение.Должник 	= Выборка.Должник;
					Движение.Новый 		= Истина;
				КонецЕсли; 
			КонецЦикла;
			
			// Регистрация количества передач
			// Получил
			Движение = Движения.Передачи.Добавить();
			Движение.Период 		= Дата;
			Движение.Сотрудник 		= Сотрудник;
			Движение.Получил 		= Должники.Количество();
			
			// Передал
			Движение = Движения.Передачи.Добавить();
			Движение.Период 		= Дата;
			Движение.Сотрудник 		= Автор;
			Движение.Передал 		= Должники.Количество();
			
			// Снимаем передачу с менеджера
			Менеджер = Справочники.Сотрудники.ПустаяСсылка();
		КонецЕсли; 
		
	КонецЕсли;
	
	// Показать список архивных должников
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПривязкаОтделСрезПоследних.Должник,
	               |	ПередачаДолжниковДолжники.Договор
	               |ИЗ
	               |	Документ.ПередачаДолжников.Должники КАК ПередачаДолжниковДолжники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаОтдел.СрезПоследних(&Момент, ) КАК ПривязкаОтделСрезПоследних
	               |		ПО (ПривязкаОтделСрезПоследних.Должник = ПередачаДолжниковДолжники.Должник)";
	
	Запрос.УстановитьПараметр("Архив", 				Перечисления.РольОтдела.Архив);
	Запрос.УстановитьПараметр("Момент", 			Дата);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	КоличествоАрхивных = Выборка.Количество();
	
	Если Сотрудник <> СотрАрхив Тогда
		Для Каждого ТекСтр Из должники Цикл
			об = ТекСтр.Договор.ПолучитьОбъект();
			если Сотрудник = СотрПредархив тогда
				об.Статус = Перечисления.СтатусыДоговоров.Предархив;
			иначе
				об.Статус = Перечисления.СтатусыДоговоров.Активный;
			конецесли;
			Об.Записать();
		КонецЦикла;
	//Если КоличествоАрхивных > 0 Тогда
	//	//Сообщить(Строка(Ссылка) + " В документе " + Строка(КоличествоАрхивных) + " должников, находящихся в архиве.
	//	//|Данные должники не могут быть переданы.", СтатусСообщения.Важное);
	//	
	//	Попытка
	//		Об = Выборка.договор.Получитьобъект();
	//		Если Сотрудник = СотрПредархив Тогда
	//			Об.Статус = перечисления.СтатусыДоговоров.Предархив;
	//		Иначе
	//			Об.статус = перечисления.СтатусыДоговоров.Активный;
	//		КонецЕСли;
	//		
	//	Исключение
	//	КонецПопытки;
	//	
	//	
	//	Пока Выборка.Следующий() Цикл
	//		Сообщить(Строка(Выборка.Должник)+" возвращен из архива!", СтатусСообщения.Информация);
	//	КонецЦикла;
	//	
	//	//Сообщить(Строка(Ссылка) + " В документе " + Строка(КоличествоАрхивных) + " должников, находящихся в архиве.
	//	//|Данные должники не могут быть переданы.", СтатусСообщения.Важное);
	//КонецЕсли; 
	КонецЕсли;
	
	////Павлов А.О.
	//СотрАрхив 		= Справочники.Сотрудники.НайтиПоНаименованию("Архив");
	//СотрПредархив 	= Справочники.Сотрудники.НайтиПоНаименованию("Предархив");
	//Если Сотрудник = СотрАрхив Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	|	Договоры.Ссылка
	//	|ИЗ
	//	|	Документ.ПередачаДолжников.Должники КАК ПередачаДолжниковДолжники
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	//	|		ПО ПередачаДолжниковДолжники.Должник = Договоры.Владелец
	//	|ГДЕ
	//	|	ПередачаДолжниковДолжники.Ссылка = &Ссылка";
	//	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		Попытка
	//		Об = Выборка.Ссылка.ПолучитьОбъект();
	//		Об.Статус = Перечисления.СтатусыДоговоров.Архив;
	//		Об.Записать();
	//	Исключение
	//		КонецПопытки;
	//	КонецЦикла;
	//ИначеЕсли Сотрудник = СотрПредархив Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	|	Договоры.Ссылка
	//	|ИЗ
	//	|	Документ.ПередачаДолжников.Должники КАК ПередачаДолжниковДолжники
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	//	|		ПО ПередачаДолжниковДолжники.Должник = Договоры.Владелец
	//	|ГДЕ
	//	|	ПередачаДолжниковДолжники.Ссылка = &Ссылка";
	//	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		Попытка
	//		Об = Выборка.Ссылка.ПолучитьОбъект();
	//		Об.Статус = Перечисления.СтатусыДоговоров.Предархив;
	//		Об.Записать();
	//	Исключение
	//		КонецПопытки;
	//	КонецЦикла;
	//КонецЕсли;
	////Павлов А.О.
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ПередачаВСвободныйПул И НЕ(РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
		СнятиеОтветственного = Истина;
	КонецЕсли; 
	
	РольОтдела = Отдел.РольОтдела;
	
	Должники.Свернуть("Должник,Договор", "");
КонецПроцедуры
